src/Documents/уатПланированиеРаботыТС/уатПланированиеРаботыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатПланированиеРаботыТС</name>
  <registerRecords>AccumulationRegister.уатПланРаботыТС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <comment>Сценарий</comment>
    <type>
      <types>CatalogRef.уатСценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьДокумента</name>
    <comment>Кратность документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическийРежимОбновленияИтоговыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПлана</name>
    <attributes>
      <name>Колонна</name>
      <type>
        <types>CatalogRef.уатКолонны</types>
      </type>
    </attributes>
    <attributes>
      <name>ДетализацияПланирования</name>
      <comment>Детализация планирования</comment>
      <type>
        <types>CatalogRef.уатТипыТС</types>
        <types>CatalogRef.уатМоделиТС</types>
        <types>CatalogRef.уатТС</types>
        <types>EnumRef.уатПринадлежностьТС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработки</name>
      <type>
        <types>CatalogRef.уатПараметрыВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПеревозки</name>
      <type>
        <types>CatalogRef.уатВидыПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <comment>Маршрут</comment>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.уатОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПеревозки</name>
      <type>
        <types>CatalogRef.уатНаправленияПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.уатСтатьиРасходов</types>
        <types>CatalogRef.уатСтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерИнтервала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/уатРазделыПланирования/уатРазделыПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатРазделыПланирования</name>
  <enumValues>
    <name>ВыработкаТСпоПЛ</name>
    <comment>(не используется) Выработка ТС по путевым листам</comment>
  </enumValues>
  <enumValues>
    <name>ВыработкаТСпоМЛ</name>
    <comment>(не используется) Выработка ТС по маршрутным листам</comment>
  </enumValues>
  <enumValues>
    <name>ПредоставленныеУслуги</name>
    <comment>Предоставленные услуги</comment>
  </enumValues>
  <enumValues>
    <name>Выработка</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходы</name>
    <comment>Доходы и Расходы</comment>
  </enumValues>
  <enumValues>
    <name>ОбъемыПеревозок</name>
  </enumValues>
</mdclass:Enum>

src/Documents/уатПланированиеРаботыТС/ObjectModule.bsl
#Область ПеременныеОбъекта

Перем мВалютаРегламентированногоУчета Экспорт;//Переменная хранит значение валюты регламентированного учёта,
                                              // полученное из констант

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.уатПланированиеРаботыТС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	уатПроведение_проф.ОтразитьПланРаботыТС(ДополнительныеСвойства, Движения, Отказ);

	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль наличия других документов с планами для тех же организации, подразделению и перевозчику
	// с пересекающимися периодами
	Документы.уатПланированиеРаботыТС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.уатПланированиеРаботыТС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
КонецПроцедуры

Процедура ПередЗаписью(Отказ,РежимЗаписи , РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ЭтотОбъект, "СоставПлана");
	
	// уатСогласованиеДокументов
	уатСогласованиеДокументовСервер.ПередЗаписью(ЭтотОбъект, РежимЗаписи, Отказ);
	// Конец уатСогласованиеДокументов
	
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	Если Сценарий.Раздел = Перечисления.уатРазделыПланирования.ПредоставленныеУслуги Тогда
		Если УчитыватьНДС Тогда
			ПроверяемыеРеквизиты.Добавить("СоставПлана.СтавкаНДС");
		КонецЕсли;
		
		Для Каждого СтрокаТаблицы Из СоставПлана Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.Договор) И СтрокаТаблицы.Договор.ВалютаВзаиморасчетов <> ВалютаДокумента Тогда
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке("В строке №" + СтрокаТаблицы.НомерСтроки + " валюта договора не совпадает с валютой документа!", Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Сценарий.Раздел = Перечисления.уатРазделыПланирования.ОбъемыПеревозок
		И Сценарий.ПланированиеОбъемовВПроцентах Тогда
		
		ТаблицаСоставПлана = СоставПлана.Выгрузить(, "ВидПеревозки, Маршрут, ОбъектСтроительства, НаправлениеПеревозки, ДетализацияПланирования, Количество");
		ТаблицаСоставПлана.Свернуть("ВидПеревозки, Маршрут, ОбъектСтроительства, НаправлениеПеревозки, ДетализацияПланирования", "Количество");
		Для Каждого ТекСтрока ИЗ ТаблицаСоставПлана Цикл
			Если ТекСтрока.Количество > 100 Тогда
				ТекстНСтр = НСтр("ru = 'По аналитикам %1 запланировано %2%3 общего количества выработки, что превышает 100%3.'");
				МассивАналитик = Новый Массив;
				Если ЗначениеЗаполнено(ТекСтрока.Маршрут) Тогда
					МассивАналитик.Добавить(ТекСтрока.Маршрут);
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекСтрока.ВидПеревозки) Тогда
					МассивАналитик.Добавить(ТекСтрока.ВидПеревозки);
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекСтрока.НаправлениеПеревозки) Тогда
					МассивАналитик.Добавить(ТекСтрока.НаправлениеПеревозки);
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекСтрока.ОбъектСтроительства) Тогда
					МассивАналитик.Добавить(ТекСтрока.ОбъектСтроительства);
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекСтрока.ДетализацияПланирования) Тогда
					МассивАналитик.Добавить(ТекСтрока.ДетализацияПланирования);
				КонецЕсли;
				ТекстНСтр = СтрШаблон(ТекстНСтр, СтрСоединить(МассивАналитик, ", "), ТекСтрока.Количество, "%");
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСтр, Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Сценарий.Раздел = Перечисления.уатРазделыПланирования.ОбъемыПеревозок Тогда
		уатОбщегоНазначенияСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СоставПлана.ДетализацияПланирования");
		
		Для Каждого СтрокаТаблицы Из СоставПлана Цикл
			Если Сценарий.Раздел = Перечисления.уатРазделыПланирования.ОбъемыПеревозок 
				И Не ЗначениеЗаполнено(СтрокаТаблицы.Контрагент) Тогда
				ТекстНСтр = СтрШаблон(НСтр("ru = 'В строке %1 не заполнен перевозчик'"), СтрокаТаблицы.НомерСтроки);
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСтр, Отказ, Заголовок);
			КонецЕсли;
			
			Если Сценарий.Раздел = Перечисления.уатРазделыПланирования.ОбъемыПеревозок 
				И Не ЗначениеЗаполнено(СтрокаТаблицы.Договор) Тогда
				ТекстНСтр = СтрШаблон(НСтр("ru = 'В строке %1 не заполнен договор с перевозчиком'"), СтрокаТаблицы.НомерСтроки);
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСтр, Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

#КонецОбласти


#Область ИсполняемаяЧастьМодуля

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецОбласти
